GetDiaphragmEccentricityOverride
Syntax
SapObject.SapModel.LoadPatterns.AutoSeismic.GetDiaphragmEccentricityOverride
VB6 Procedure
Function GetDiaphragmEccentricityOverride(ByVal Name As String, ByRef Num As Long, ByRef Diaph() As String, ByRef Eccen() As Double) As Long
Parameters
Name
The name of an existing Quake-type load pattern that has an auto seismic load assigned.
Num
The number of diaphragm eccentricity overrides for the specified load pattern.
Diaph
This is an array that includes the names of the diaphragms which have eccentricity overrides.
Eccen
This is an array that includes the eccentricity applied to each diaphragm. [L]
Remarks
This function retrieves diaphragm eccentricity overrides for auto seismic loads. This function does not apply for User Load type auto seismic loads.
The function returns zero if the overrides are successfully retrieved; otherwise it returns a nonzero value.
VBA Example
Sub GetSeismicDiaphragmEccentricityOverride()
 'dimension variables
 Dim SapObject as cOAPI
 Dim SapModel As cSapModel
 Dim ret As Long
 Dim Num As Long
 Dim Diaph() As String
 Dim Eccen() As Double
 'create Sap2000 object
 Set SapObject = New Sap2000v16.SapObject
 'start Sap2000 application
 SapObject.ApplicationStart
 'create SapModel object
 Set SapModel = SapObject.SapModel
 'initialize model
 ret = SapModel.InitializeNewModel
 'create model from template
 ret = SapModel.File.New3DFrame(BeamSlab, 2, 144, 3, 336, 2, 432)
 'define diaphragm constraints
 ret = SapModel.ConstraintDef.SetDiaphragm("Diaph1", Z)
 ret = SapModel.ConstraintDef.SetDiaphragm("Diaph2", Z)
 'assign points to diaphragm
 ret = SapModel.SelectObj.ClearSelection
 ret = SapModel.SelectObj.PlaneXY("2")
 ret = SapModel.PointObj.SetConstraint("", "Diaph1", SelectedObjects)
 ret = SapModel.SelectObj.ClearSelection
 ret = SapModel.SelectObj.PlaneXY("3")
 ret = SapModel.PointObj.SetConstraint("", "Diaph2", SelectedObjects)
 ret = SapModel.SelectObj.ClearSelection
 'add new load pattern
 ret = SapModel.LoadPatterns.Add("EQX", LTYPE_QUAKE)
 'assign BOCA96 parameters
 ret = SapModel.LoadPatterns.AutoSeismic.SetBOCA96("EQX", 1, 0.05, 1, 0.035, 0, False, 0, 0, 0.4, 0.4, 1.5, 8)
 'assign diaphragm eccentricity override
 ret = SapModel.LoadPatterns.AutoSeismic.SetDiaphragmEccentricityOverride("EQX", "Diaph1", 50)
 'get diaphragm eccentricity override
 ret = SapModel.LoadPatterns.AutoSeismic.GetDiaphragmEccentricityOverride("EQX", Num, Diaph, Eccen)
 'close Sap2000
 SapObject.ApplicationExit False
 Set SapModel = Nothing
 Set SapObject = Nothing
 End Sub
Release Notes
Initial release in version 11.01.
Changed nomenclature from Load Cases, Analysis Cases and Response Combinations to Load Patterns, Load Cases and Load Combinations, respectively, in version 12.00.
See Also
SetDiaphragmEccentricityOverride
GetSpecialRigidDiaphragmList